/**
 * ws v2错误提示语
 */
let code = {
  4001: '服务异常',
  4002: 'JSON数据格式不正确',
  4003: '用户id错误',
  4004: 'HTTP请求异常',
  4005: 'DATA为空',
  4006: '数据格式异常',
  4007: '设备未绑定',
  4008: '不支持订阅此topic',
  4009: '不支持同时订阅同类topic',
  4010: '操作类型不支持',
  4011: '发送数据失败',
  4012: '设备未认证',
  4013: '设备激活码不足',
  4014: '产品类型和参数不匹配',
  4015: 'productKey为空',
  4016: 'productKey格式不正确',
  4017: 'deviceKey为空',
  4018: 'deviceKey格式不正确',
  4019: '物模型解析失败',
  4020: 'msgId格式不正确',
  4021: '设备已离线，请稍后再试',
  4023: '下行topic不支持',
  4024: '子设备未连接到网关'
}

/***
 * 接口提示语
 */
let wsCode = {
  /**
   * 获取ws错误提示语
   */
  getCodeTxt () {
    return code
  }
}

module.exports = wsCode
